
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:

let xxx = [2,17,13,6,22,31,45,66,100,-18];

// 1. перебрати його циклом while

// p = 0;
// while (p < xxx.length){
//   console.log(xxx[p]);
//   p++;
// }


// 1. перебрати його циклом while в зворотньому циклі (с заду на перед)

// let p = xxx.length-1
// while ( p >= 0){
//   console.log(xxx[p]);
//   p--;
// }


// 2. перебрати його циклом for

// for (p = 0; p < xxx.length; p++) {
//   console.log(xxx[p]);
// }


// 2. перебрати його циклом for в зворотньому циклі (с заду на перед)


// for (p = xxx.length-1; p >=0; p--){
//   console.log(xxx[p]);
// }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом


// p = 0;
// while (p < xxx.length) {
//   if (p % 2 === 1){
//             console.log(xxx[p]);
//         };
//         p++;
//     };



// 3. перебрати циклом while та вивести  числа тільки з непарним індексом в зворотньому циклі (с заду на перед)

// let p = xxx.length-1;
// while (p >= 0){
//    if (p % 2 === 0){             // в цьому місці не зрозумів як правильно рахувати p % 2 === 1 якщо такий запис
//             console.log(xxx[p]);  // то воно покажи зворотній рахунок від попереднього (але -18 в нас вийде парне),
//         };                      // а якщо такий запис p % 2 === 0 то тоді воно покаже рахунок зі числа 100,
//         p--;                    // тобто воно рахуватиметься як непарне, в настуних завдання теж саме
// }


// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// for (ghj = 1; ghj < xxx.length; ghj+=2) {
//   console.log(xxx[ghj]);
// }



// 4. перебрати циклом for та вивести  числа тільки з непарним індексом в зворотньому циклі (с заду на перед)

// for (let ghj = xxx.length-2; ghj >=0; ghj-=2){
//   console.log(xxx[ghj]);
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення


// iii=0;
// while (iii < xxx.length){
//   if (iii % 2 === 0) {
//     console.log(xxx[iii]);
//   }
//   iii++;
// }


// 5. перебрати циклом while та вивести  числа тільки парні  значення в зворотньому циклі (с заду на перед)

// let iii = xxx.length-1;
// while (iii >= 0) {
//   if (iii % 2 === 1){
//     console.log(xxx[iii]);
//   }
//   iii--;
// }



// 6. перебрати циклом for та вивести  числа тільки парні  значення


// for (let fghj = 0; fghj < xxx.length; fghj+=2) {
//   console.log(xxx[fghj]);
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення в зворотньому циклі (с заду на перед)

// for (fghj = xxx.length-1; fghj >=0; fghj-=2){
//   console.log(xxx[fghj]);
// }

// 7. замінити кожне число кратне 3 на слово "okten"

// for (let gasjk = 0; gasjk < xxx.length; gasjk++) {
//     if (xxx[gasjk] % 3 === 0) {
//         xxx[gasjk] = "okten";
//     }
//     console.log(xxx[gasjk]);
// }
// console.log(xxx);

// 7. замінити кожне число кратне 3 на слово "okten" в зворотньому циклі (с заду на перед)

// for (gasjk = xxx.length-1; gasjk >=0; gasjk--){
//   if (xxx[gasjk] % 3 === 0) {
//     xxx[gasjk] = "okten";
//   }
//   console.log(xxx[gasjk]);
// }
// console.log(xxx);


// 8. вивести масив в зворотньому порядку.


// for (let massuv = xxx.length-1; massuv >= 0; massuv--) {
//     console.log(xxx[massuv]);
// }